Revit 2027 API
ParameterTypeId.ContinuousrailJoinTypeParam Property
 "Rail Path Join"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ContinuousrailJoinTypeParam { get; }
Public Shared ReadOnly Property ContinuousrailJoinTypeParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ContinuousrailJoinTypeParam {
	ForgeTypeId^ get ();
}
static member ContinuousrailJoinTypeParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace